import sys

# Напишите вашу функцию тут.

# Не меняйте код ниже, он нужен для проверки задания
values = list(map(int, sys.argv[1:]))
print(sum_mult_index(values))