import sys

# Список городов
cities = [
    # Клд  Мск   СПб,  Каз   Врж,  Тверь
    [0, 1337, 1103, 2192, 1855, 1255],  # Калининград
    [1337, 0, 712, 825, 522, 192],  # Москва
    [1103, 712, 0, 1526, 1337, 531],  # Санкт-Петербург
    [2192, 825, 1526, 0, 1080, 1006],  # Казань
    [1855, 522, 1337, 1080, 0, 815],  # Воронеж
    [1255, 192, 531, 1006, 815, 0]  # Тверь
]


# Напишите код функции тут.
def calc_distance(path):
    distance = 0
    line = 0
    for idx in path:
        distance += cities[line][idx]
    line = idx
    return distance



# Получаем путь в виде списка: [0, 1, 2]
path = list(map(int, sys.argv[1:]))

# Выводим результат
print(calc_distance(path))

# (Казань - Калининград - Тверь
# print(calc_distance([3, 0, 5]))
# 3447
